package collection.list;

import java.util.Stack;

public class List {
    /**

     List - упорядоченная последовательность элементов, позволяющая
     хранить дубликаты и null. Каждый элемент имеет индекс.

                      List
               ||       ||       \\
               V        V         V
     ArrayList        Vector        LinkedList
                        ||
                        V
                       Stack

     List по-сравнению с ArrayList:
     - неизменяемый
     - не может содержать null

     смотри методы в папке аррей лист

     Vector - не рекомендуется использовать
     То же самое, что и ArrayList, но для работы с многопоточностью
     Устаревший, очень медленный

     Stack - не рекомендуется использовать
     Тоже устаревший
     Stack использует принцип LIFO (Last in first out) -
     (принцип тарелок, какую последнюю в стопку сложил, ту первой и возьмешь)

     */

}
